Revit 2027 API
ExporterIFC.GetFamilyInstanceAssemblyOffset Method
Note: This API is now obsolete.
 Obtains Translation to adjust Family Instance within an Assembly, based on Family Symbol origin change.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use FamilySymbol Origin property instead.")]
public XYZ GetFamilyInstanceAssemblyOffset(
	FamilyInstance familyInstance
)
<ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use FamilySymbol Origin property instead.")>
Public Function GetFamilyInstanceAssemblyOffset (
	familyInstance As FamilyInstance
) As XYZ
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use FamilySymbol Origin property instead.")]
XYZ^ GetFamilyInstanceAssemblyOffset(
	FamilyInstance^ familyInstance
)
[<ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use FamilySymbol Origin property instead.")>]
member GetFamilyInstanceAssemblyOffset :
        familyInstance : FamilyInstance -> XYZ
Parameters
familyInstance FamilyInstance
 The family instance.
Return Value
XYZ
 Translation for Family Instance.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace